# Brewfile — manually curated. Do NOT replace via `brew bundle dump`;
# that would re-introduce VS Code extensions and erase these section
# comments. Edit by hand instead.

# === Taps ===
tap "hashicorp/tap"
tap "homebrew/cask"
tap "homebrew/core"
tap "jandedobbeleer/oh-my-posh"
tap "mongodb/brew"
tap "qiushiyan/degit", "https://github.com/qiushiyan/degit"
tap "supabase/tap"

# === Build dependencies & libraries ===
brew "libpng"
brew "xz"
brew "zstd"
brew "openssl@3"
brew "protobuf"
brew "grpc"
brew "thrift"
brew "apache-arrow"
brew "apr-util"
brew "automake"
brew "cryptography"
brew "libgit2"
brew "glib"
brew "gmp"
brew "gcc"
brew "libomp", link: true
brew "clp"
brew "cmake"
brew "libavif"
brew "gd"
brew "pkgconf"
brew "hdf5"
brew "krb5"
brew "shared-mime-info"
brew "libheif"
brew "libspatialite"
brew "netcdf"
brew "openjpeg"
brew "gdal"
brew "gdk-pixbuf"
brew "gobject-introspection"
brew "netpbm"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "ldns"
brew "libdap"
brew "libfido2"
brew "libsodium"
brew "tcl-tk"
brew "open-mpi"

# === Shell & terminal ===
brew "bat"
brew "bc"
brew "coreutils"
brew "dust"
brew "fd"
brew "fzf"
brew "jq"
brew "lazygit"
brew "macos-trash", link: true
brew "moreutils", link: false
brew "neovim"
brew "openssh"
brew "ripgrep"
brew "rsync"
brew "sesh"
brew "stow"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "wget"
brew "z"
brew "lua"
brew "luarocks"

# === Languages & toolchains ===
brew "go"
brew "node"
brew "nvm"
brew "rustup"
brew "swift"
brew "deno"
brew "uv"
brew "ruby", link: true
brew "python-setuptools"

# === Code formatters & linters ===
brew "ast-grep"
brew "biome"
brew "ruff"
brew "stylua"
brew "xcode-build-server"

# === Cloud, infra, dev services ===
brew "act"
brew "awscli"
brew "docker"
brew "flyctl"
brew "gh"
brew "git-lfs"
brew "goreleaser"
brew "k9s"
brew "kustomize"
brew "rclone"
brew "redis"
brew "postgresql@16", restart_service: :changed
brew "mongosh"
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "hashicorp/tap/terraform"
brew "mongodb/brew/mongodb-community"
brew "supabase/tap/supabase"
brew "qiushiyan/degit/degit"

# === Media, docs, AI tooling ===
brew "ffmpeg"
brew "graphviz"
brew "httpie"
brew "imagemagick"
brew "pandoc"
brew "yt-dlp"
brew "gnupg"
brew "opencode"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"

# === GUI apps (casks) ===
cask "codex"
cask "discord"
cask "linear"
cask "mongodb-compass"
cask "postman"
cask "raycast"
cask "rectangle"
cask "sf-symbols"
cask "slack"
cask "swiftformat-for-xcode"
cask "xquartz"

# === Fonts ===
cask "font-blex-mono-nerd-font"
cask "font-cascadia-code"
cask "font-code-new-roman-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-iosevka-term-nerd-font"
cask "font-maple-mono-nf-cn"
cask "font-noto-color-emoji"
cask "font-noto-emoji"
cask "font-noto-nerd-font"
cask "font-noto-sans-cjk-sc"
cask "font-noto-serif-cjk-sc"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-victor-mono-nerd-font"

# === Go binaries (installed via `go install`) ===
go "github.com/cosmtrek/air"
go "github.com/hibiken/asynqmon/cmd/asynqmon"
go "github.com/qiushiyan/caturday"
go "github.com/spf13/cobra-cli"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/divan/expvarmon"
go "github.com/segmentio/golines"
go "golang.org/x/tools/gopls"
go "github.com/rakyll/hey"
go "sigs.k8s.io/kind"
go "github.com/tj/mmake/cmd/mmake"
go "go.uber.org/mock/mockgen"
go "go.uber.org/nilaway/cmd/nilaway"
go "golang.org/x/pkgsite/cmd/pkgsite"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "github.com/qiushiyan/qlang/cmd/q"
go "github.com/qiushiyan/gemini-search"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
go "github.com/go-swagger/go-swagger/cmd/swagger"
go "github.com/wailsapp/wails/v2/cmd/wails"

# === Cargo binaries (installed via `cargo install`) ===
cargo "cargo-wasi"
cargo "evcxr_jupyter"
cargo "evcxr_repl"
cargo "trunk"
cargo "wasm-bindgen-cli"
