tap "gaborcsardi/rim"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/cask"
tap "homebrew/core"
tap "learlab/itell-cli", "https://github.com/learlab/itell-cli"
tap "mongodb/brew"
tap "qiushiyan/degit", "https://github.com/qiushiyan/degit"
tap "supabase/tap"
tap "tonisives/tap"
brew "act"
brew "libpng"
brew "xz"
brew "zstd"
brew "openssl@3"
brew "protobuf"
brew "grpc"
brew "thrift"
brew "apache-arrow"
brew "apr-util"
brew "ast-grep"
brew "automake"
brew "cryptography"
brew "aws-sam-cli"
brew "awscli"
brew "libgit2"
brew "bat"
brew "bc"
brew "biome"
brew "glib"
brew "gmp"
brew "gcc"
brew "libomp", link: true
brew "clp"
brew "cmake"
brew "coreutils"
brew "deno"
brew "docker"
brew "dust"
brew "fd"
brew "ffmpeg"
brew "flyctl"
brew "fzf"
brew "libavif"
brew "gd"
brew "gnupg"
brew "pkgconf"
brew "hdf5"
brew "krb5"
brew "shared-mime-info"
brew "libheif"
brew "libspatialite"
brew "netcdf"
brew "openjpeg"
brew "gdal"
brew "gdk-pixbuf"
brew "gh"
brew "git-lfs"
brew "go"
brew "gobject-introspection"
brew "goreleaser"
brew "netpbm"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "kustomize"
brew "lazygit"
brew "ldns"
brew "libdap"
brew "libfido2"
brew "libsodium"
brew "lua"
brew "luarocks"
brew "macos-trash", link: true
brew "node"
brew "mongosh"
brew "moreutils", link: false
brew "neovim"
brew "nvm"
brew "open-mpi"
brew "ripgrep"
brew "opencode"
brew "openssh"
brew "pandoc"
brew "postgresql@16", restart_service: :changed
brew "protoc-gen-go"
brew "protoc-gen-go-grpc"
brew "python-setuptools"
brew "qwen-code"
brew "rclone"
brew "redis"
brew "rsync"
brew "ruby", link: true
brew "ruff"
brew "rustup"
brew "sesh"
brew "starship"
brew "stow"
brew "stylua"
brew "swift"
brew "tcl-tk"
brew "tldr"
brew "tmux"
brew "trash"
brew "tree"
brew "uv"
brew "wget"
brew "xcode-build-server"
brew "yt-dlp"
brew "z"
brew "hashicorp/tap/terraform"
brew "learlab/itell-cli/itell"
brew "mongodb/brew/mongodb-community"
brew "qiushiyan/degit/degit"
brew "supabase/tap/supabase"
cask "codex"
cask "discord"
cask "fig"
cask "font-blex-mono-nerd-font"
cask "font-cascadia-code"
cask "font-code-new-roman-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-maple-mono-nf-cn"
cask "font-noto-color-emoji"
cask "font-noto-emoji"
cask "font-noto-nerd-font"
cask "font-noto-sans-cjk-sc"
cask "font-noto-serif-cjk-sc"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-victor-mono-nerd-font"
cask "ghostty"
cask "hyper"
cask "linear-linear"
cask "logitech-g-hub"
cask "mongodb-compass"
cask "tonisives/tap/ovim"
cask "pgadmin4"
cask "postman"
cask "raycast"
cask "rectangle"
cask "gaborcsardi/rim/rim"
cask "rstudio"
cask "sf-symbols"
cask "slack"
cask "swiftformat-for-xcode"
cask "xquartz"
vscode "aaravb.chrome-extension-developer-tools"
vscode "ahmadawais.shades-of-purple"
vscode "akamud.vscode-theme-onedark"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "anthropic.claude-code"
vscode "apvarun.celestial"
vscode "arthurwhite.white"
vscode "artlaman.chalice-icon-theme"
vscode "astro-build.astro-vscode"
vscode "astro-build.houston"
vscode "atomiks.moonlight"
vscode "bceskavich.theme-dracula-at-night"
vscode "beckqin.swagger-go-doc"
vscode "benjaminbenais.copilot-theme"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bradlc.vscode-tailwindcss"
vscode "brucelinker.sqlcaps"
vscode "catppuccin.catppuccin-vsc"
vscode "charliermarsh.ruff"
vscode "clarkyu.vscode-sql-beautify"
vscode "connor4312.esbuild-problem-matchers"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-postgresql-client2"
vscode "daltonmenezes.aura-theme"
vscode "dbaeumer.vscode-eslint"
vscode "degreat.fonted"
vscode "dereckdamphouse.atom-just-black"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dracula-theme.theme-dracula"
vscode "drcika.apc-extension"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "emeraldwalk.runonsave"
vscode "enhancedjax.vscode-ayu-zed"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "eserozvataf.one-dark-pro-monokai-darker"
vscode "fabian-hiller.pace-theme"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "ginfuru.lunar-eclipse"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "harg.iceberg"
vscode "humao.rest-client"
vscode "irongeek.vscode-env"
vscode "jakebecker.elixir-ls"
vscode "janisdd.vscode-edit-csv"
vscode "jdinhlife.gruvbox"
vscode "joelcrosby.one-dark-darker"
vscode "josemurilloc.aura-spirit-dracula"
vscode "jpoissonnier.vscode-styled-components"
vscode "juniorschmidt.lunar-vscode-theme"
vscode "laggardkernel.vscode-theme-onelight"
vscode "leveluptutorials.theme-levelup"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "lunuan.kubernetes-templates"
vscode "majorbreakfast.ultimate-white"
vscode "maosantaella.night-wolf"
vscode "mechatroner.rainbow-csv"
vscode "miguelsolorio.fluent-icons"
vscode "miguelsolorio.symbols"
vscode "million.million-lint"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.extension-test-runner"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-typescript-next"
vscode "mtxr.sqltools"
vscode "mvllow.rose-pine"
vscode "nicolasdschmidt.lunar-pink"
vscode "njpwerner.autodocstring"
vscode "nomicfoundation.hardhat-solidity"
vscode "orsenkucher.vscode-graphql"
vscode "patbenatar.advanced-new-file"
vscode "pbkit.vscode-pbkit"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "raunofreiberg.vesper"
vscode "redhat.vscode-yaml"
vscode "reditorsupport.r"
vscode "reditorsupport.r-syntax"
vscode "ritwickdey.liveserver"
vscode "rphlmr.paperus"
vscode "rubbersheep.gi"
vscode "rust-lang.rust-analyzer"
vscode "samueldsr99.vesper-light"
vscode "sdras.inbedby7pm"
vscode "sdras.night-owl"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "singularitti.vscode-julia-formatter"
vscode "sldobri.daily"
vscode "solidhelium.zed-theme"
vscode "solidjs-community.solid-snippets"
vscode "sonusinha.dark-blue-theme"
vscode "stackblitz.tutorialkit"
vscode "streetsidesoftware.code-spell-checker"
vscode "sumneko.lua"
vscode "svelte.svelte-vscode"
vscode "swiftlang.swift-vscode"
vscode "swyphcosmo.spellchecker"
vscode "syler.sass-indented"
vscode "tailwindlabs.tailwindcss-vscode-theme"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "thedavej.night-owl-black"
vscode "tomoki1207.pdf"
vscode "tsandall.opa"
vscode "tyriar.lorem-ipsum"
vscode "ultram4rine.vscode-choosealicense"
vscode "undefined_publisher.@itell/vscode"
vscode "unifiedjs.vscode-mdx"
vscode "unional.vscode-sort-package-json"
vscode "usernamehw.errorlens"
vscode "voldemortensen.rainbow-tags"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wallabyjs.console-ninja"
vscode "wesbos.theme-cobalt2"
vscode "wicked-labs.sequoia"
vscode "wicked-labs.wvsc-serendipity"
vscode "will-stone.plastic"
vscode "xephalpha.syntax"
vscode "yoavbls.pretty-ts-errors"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
go "github.com/cosmtrek/air"
go "github.com/hibiken/asynqmon/cmd/asynqmon"
go "github.com/qiushiyan/caturday"
go "github.com/spf13/cobra-cli"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/divan/expvarmon"
go "github.com/segmentio/golines"
go "golang.org/x/tools/gopls"
go "github.com/rakyll/hey"
go "sigs.k8s.io/kind"
go "github.com/tj/mmake/cmd/mmake"
go "go.uber.org/mock/mockgen"
go "go.uber.org/nilaway/cmd/nilaway"
go "golang.org/x/pkgsite/cmd/pkgsite"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "github.com/qiushiyan/qlang/cmd/q"
go "github.com/qiushiyan/gemini-search"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
go "github.com/go-swagger/go-swagger/cmd/swagger"
go "github.com/wailsapp/wails/v2/cmd/wails"
cargo "cargo-wasi"
cargo "evcxr_jupyter"
cargo "evcxr_repl"
cargo "trunk"
cargo "wasm-bindgen-cli"
